alibaba/AliOS-Things/platform/mcu/atsaml21/saml21b/svd/ATSAML21E16B.svd
        <register>
          <name>AVGCTRL</name>
          <description>Average Control</description>
          <addressOffset>0x0C</addressOffset>
          <size>8</size>
          <fields>
            <field>
              <name>SAMPLENUM</name>
              <description>Number of Samples to be Collected</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
              <enumeratedValues>
                <name>SAMPLENUMSelect</name>
                <enumeratedValue>
                  <name>1</name>
                  <description>1 sample</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>2</name>
                  <description>2 samples</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>4</name>
                  <description>4 samples</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>8</name>
                  <description>8 samples</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>16</name>
                  <description>16 samples</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>32</name>
                  <description>32 samples</description>
                  <value>0x5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>64</name>
                  <description>64 samples</description>
                  <value>0x6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>128</name>
                  <description>128 samples</description>
                  <value>0x7</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>256</name>
                  <description>256 samples</description>
                  <value>0x8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>512</name>
                  <description>512 samples</description>
                  <value>0x9</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1024</name>
                  <description>1024 samples</description>
                  <value>0xa</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ADJRES</name>
              <description>Adjusting Result / Division Coefficient</description>
              <bitOffset>4</bitOffset>
              <bitWidth>3</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>SAMPCTRL</name>
          <description>Sample Time Control</description>
          <addressOffset>0x0D</addressOffset>
          <size>8</size>
          <fields>
            <field>
              <name>SAMPLEN</name>
              <description>Sampling Time Length</description>
              <bitOffset>0</bitOffset>
              <bitWidth>6</bitWidth>
            </field>
            <field>
              <name>OFFCOMP</name>
              <description>Comparator Offset Compensation Enable</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>WINLT</name>
          <description>Window Monitor Lower Threshold</description>
          <addressOffset>0x0E</addressOffset>
          <size>16</size>
          <fields>
            <field>
              <name>WINLT</name>
              <description>Window Lower Threshold</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>WINUT</name>
          <description>Window Monitor Upper Threshold</description>
          <addressOffset>0x10</addressOffset>
          <size>16</size>
          <fields>
            <field>
              <name>WINUT</name>
              <description>Window Upper Threshold</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>GAINCORR</name>
          <description>Gain Correction</description>
          <addressOffset>0x12</addressOffset>
          <size>16</size>
          <fields>
            <field>
              <name>GAINCORR</name>
              <description>Gain Correction Value</description>
              <bitOffset>0</bitOffset>
              <bitWidth>12</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>OFFSETCORR</name>
          <description>Offset Correction</description>
          <addressOffset>0x14</addressOffset>
          <size>16</size>
          <fields>
            <field>
              <name>OFFSETCORR</name>
              <description>Offset Correction Value</description>
              <bitOffset>0</bitOffset>
              <bitWidth>12</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>SWTRIG</name>
          <description>Software Trigger</description>
          <addressOffset>0x18</addressOffset>
          <size>8</size>
          <fields>
            <field>
              <name>FLUSH</name>
              <description>ADC Flush</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>START</name>
              <description>Start ADC Conversion</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>DBGCTRL</name>
          <description>Debug Control</description>
          <addressOffset>0x1C</addressOffset>
          <size>8</size>
          <fields>
            <field>
              <name>DBGRUN</name>
              <description>Debug Run</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>SYNCBUSY</name>
          <description>Synchronization Busy</description>
          <addressOffset>0x20</addressOffset>
          <size>16</size>
          <access>read-only</access>
          <fields>
            <field>
              <name>SWRST</name>
              <description>SWRST Synchronization Busy</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>ENABLE</name>
              <description>ENABLE Synchronization Busy</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>INPUTCTRL</name>
              <description>INPUTCTRL Synchronization Busy</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>CTRLC</name>
              <description>CTRLC Synchronization Busy</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>AVGCTRL</name>
              <description>AVGCTRL Synchronization Busy</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>SAMPCTRL</name>
              <description>SAMPCTRL Synchronization Busy</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>WINLT</name>
              <description>WINLT Synchronization Busy</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>WINUT</name>
              <description>WINUT Synchronization Busy</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>GAINCORR</name>
              <description>GAINCORR Synchronization Busy</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>OFFSETCORR</name>
              <description>OFFSETCTRL Synchronization Busy</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>SWTRIG</name>
              <description>SWTRG Synchronization Busy</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>RESULT</name>
          <description>Result</description>
          <addressOffset>0x24</addressOffset>
          <size>16</size>
          <access>read-only</access>
          <fields>
            <field>
              <name>RESULT</name>
              <description>Result Value</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SEQCTRL</name>
          <description>Sequence Control</description>
          <addressOffset>0x28</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>SEQEN</name>
              <description>Enable Positive Input in the Sequence</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>CALIB</name>
          <description>Calibration</description>
          <addressOffset>0x2C</addressOffset>
          <size>16</size>
          <fields>
            <field>
              <name>BIASCOMP</name>
              <description>Bias Comparator Scaling</description>
              <bitOffset>0</bitOffset>
              <bitWidth>3</bitWidth>
            </field>
            <field>
              <name>BIASREFBUF</name>
              <description>Bias  Reference Buffer Scaling</description>
              <bitOffset>8</bitOffset>
              <bitWidth>3</bitWidth>
            </field>
          </fields>
        </register>
